#ifndef PARSER_H
#define PARSER_H

#include <Arduino.h>
#include "Status.h"

/*
    --------------------------------------------------------------------

    Parser

    وظیفه این کلاس فقط و فقط تجزیه پیام‌های دریافتی از پرینتر است.

    این کلاس هیچ اطلاعی از WebSocket ندارد.

    هیچ اطلاعی از ESP32 ندارد.

    هیچ اطلاعی از Serial ندارد.

    تنها کاری که انجام می‌دهد:

        JSON -----> PrinterStatus

    --------------------------------------------------------------------
*/

class Parser
{
public:

    Parser();

    /*
        begin()

        آدرس Struct مربوط به وضعیت پرینتر را دریافت می‌کند.

        بعد از این مرحله هر اطلاعاتی که از پرینتر دریافت شود
        داخل همین Struct ذخیره خواهد شد.
    */
    void begin(PrinterStatus* status);

    /*
        parse()

        در نسخه فعلی فقط پیام دریافتی را نمایش می‌دهد.

        در نسخه بعدی JSON را تجزیه خواهد کرد.
    */
    void parse(const String& payload);

private:

    /*
        اشاره‌گر به وضعیت پرینتر

        دلیل استفاده از Pointer این است که نمی‌خواهیم
        یک کپی جدید از PrinterStatus ساخته شود.

        تمام کلاس‌ها روی یک حافظه مشترک کار خواهند کرد.
    */
    PrinterStatus* _status;

};

#endif